blog/como-se-llama-este-libro-porcia/como-se-llama-este-libro-porcia.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2018-08-17 vie 20:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>El Cluedo como problema de lógica de segundo orden</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Álvaro González Sotillo" />
<meta name="description" content="En &quot;¿Cómo se llama este libro?&quot; se describen muchos problemas lógicos. Los de las cajas de Porcia pueden resolverse con programación por restricciones."
 />
<meta name="keywords" content="AI,programación,javascript" />
<link rel="stylesheet" href="./tabthis.css"/>
</head>
<body>
<div id="content">
<h1 class="title">El Cluedo como problema de lógica de segundo orden</h1>


<div id="outline-container-org6b1074d" class="outline-2">
<h2 id="org6b1074d"><span class="section-number-2">1</span> Problemas de cajas de Porcia</h2>
<div class="outline-text-2" id="text-1">
<p>
El libro <i>¿Cómo se llama este libro?</i> es un clásico de las matemáticas recreativas. Entre sus numerosos problemas, hay un tipo relativo a cajas con inscripciones ciertas o falsas, y se debe encontrar la caja que contiene un retrato (o una daga) utilizando sólo la lógica. Este es el primero de esos problemas:
</p>


<blockquote>
<p>

</p>

<p>
En <i>El mercader de Venecia</i>, de Shakespeare, Porcia tenia tres cofres
---uno de oro, otro de plata y otro de plomo---, dentro de uno de los
cuales estaba el retrato de Porcia. El pretendiente tenía que elegir uno
de los cofres y si tenía suerte (o inteligencia) elegiría el que tenía
el retrato, pudiendo así pedir a Porcia por esposa. En la tapa de cada
cofre había una inscripción para ayudar al pretendiente a elegir
sabiamente.
</p>

<p>
Pero supongamos que Porcia quisiera elegir marido, no por su bondad,
sino por su inteligencia. Tendría las siguientes inscripciones en los
cofres:
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Oro</td>
</tr>

<tr>
<td class="org-left">EL RETRATO ESTÁ EN ESTE COFRE</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Plata</td>
</tr>

<tr>
<td class="org-left">EL RETRATO NO ESTÁ AQUÍ</td>
</tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Plomo</td>
</tr>

<tr>
<td class="org-left">EL RETRATO NO ESTÁ EN EL COFRE DE ORO</td>
</tr>
</tbody>
</table>


<p>
Porcia explicó al pretendiente que de los tres enunciados, a lo sumo uno
era verdad. ¿Cuál cofre debe de elegir el pretendiente?
</p>
</blockquote>


<p>
Este problema puede resolverse utlizando como motor lógico el ya implementado para <a href="../../../blog/el-cluedo-como-problema-de-logica">resolver el cluedo</a>.
</p>
</div>
</div>

<div id="outline-container-org0a8c27b" class="outline-2">
<h2 id="org0a8c27b"><span class="section-number-2">2</span> Motor lógico</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Motor</li>
</ul>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b9ca4a;">const</span> <span style="color: #e7c547;">manager</span> = <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">CPManager</span>();
</pre>
</div>
<ul class="org-ul">
<li>Variables booleanas</li>
<li>Restricciones entre variables</li>
</ul>
</div>
</div>

<div id="outline-container-orgdec6a74" class="outline-2">
<h2 id="orgdec6a74"><span class="section-number-2">3</span> Cofres</h2>
<div class="outline-text-2" id="text-3">
<p>
Cada cofre tiene un nombre y una variable booleana que indica si contiene o no algo. Posteriormente a su creación se le pueden añadir varias inscripciones.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listado de programa 1 </span>Incio de la clase <code>Cofre</code></label><pre class="src src-javascript"><span style="color: #b9ca4a;">class</span> Cofre{
    constructor(manager,nombre){
        <span style="color: #7aa6da;">this</span>._manager = manager;
        <span style="color: #7aa6da;">this</span>._nombre = nombre;
        <span style="color: #7aa6da;">this</span>._cofreLleno = manager.Boolean( <span style="color: #70c0b1;">"El cofre "</span> + <span style="color: #7aa6da;">this</span>._nombre + <span style="color: #70c0b1;">" est&#225; lleno"</span> );
    }

    get nombre(){
        <span style="color: #b9ca4a;">return</span> <span style="color: #7aa6da;">this</span>._nombre;
    }

    set inscripciones(ins){
        <span style="color: #b9ca4a;">if</span>( <span style="color: #b9ca4a;">typeof</span> <span style="color: #7aa6da;">this</span>._inscripciones != <span style="color: #70c0b1;">"undefined"</span> ){
            <span style="color: #b9ca4a;">throw</span> <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">Error</span>(<span style="color: #70c0b1;">"No se pueden cambiar las inscripciones de un cofre"</span>);
        }

        <span style="color: #7aa6da;">this</span>._inscripciones = ins.slice(0);
    }

    get inscripciones(){
        <span style="color: #b9ca4a;">return</span> <span style="color: #7aa6da;">this</span>._inscripciones.slice(0);
    }


    get cofreLleno(){
        <span style="color: #b9ca4a;">return</span> <span style="color: #7aa6da;">this</span>._cofreLleno;
    }

    get manager(){
        <span style="color: #b9ca4a;">return</span> <span style="color: #7aa6da;">this</span>._manager;
    }

    ....

</pre>
</div>

<p>
Los cofres se crean todos juntos. Al crearse, una restricción se asegura que solo uno de ellos está lleno.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listado de programa 2 </span>Continuación de la clase <code>Cofre</code></label><pre class="src src-javascript">
    ....

    <span style="color: #b9ca4a;">static</span> soloUnCofreLleno(cofres){
        <span style="color: #b9ca4a;">var</span> <span style="color: #e7c547;">llenos</span> = cofres.map( c =&gt; c.cofreLleno );
        <span style="color: #b9ca4a;">let</span> <span style="color: #e7c547;">manager</span> = cofres[0].manager;
        <span style="color: #b9ca4a;">var</span> <span style="color: #e7c547;">soloUnoLleno</span> = manager.SomeTrue(llenos,1).
            rename(<span style="color: #70c0b1;">"Solo un cofre lleno en total"</span>).
            asTrue();
        <span style="color: #b9ca4a;">return</span> soloUnoLleno;
    }

    <span style="color: #b9ca4a;">static</span> creaCofres(CP,nombres){
        <span style="color: #b9ca4a;">var</span> <span style="color: #e7c547;">ret</span> = nombres.map( n =&gt; <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">Cofre</span>(CP,n) );
        Cofre.soloUnCofreLleno(ret);
        <span style="color: #b9ca4a;">return</span> ret;
    }

}
</pre>
</div>

<p>
El problema descrito anteriormente se expresaría así:
</p>

<problemaporciaysolucion>
<blockquote>
<p>

</p>

<p>
En <i>El mercader de Venecia</i>, de Shakespeare, Porcia tenia tres cofres
---uno de oro, otro de plata y otro de plomo---, dentro de uno de los
cuales estaba el retrato de Porcia. El pretendiente tenía que elegir uno
de los cofres y si tenía suerte (o inteligencia) elegiría el que tenía
el retrato, pudiendo así pedir a Porcia por esposa. En la tapa de cada
cofre había una inscripción para ayudar al pretendiente a elegir
sabiamente.
</p>

<p>
Pero supongamos que Porcia quisiera elegir marido, no por su bondad,
sino por su inteligencia. Tendría las siguientes inscripciones en los
cofres:
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Oro</td>
</tr>

<tr>
<td class="org-left">EL RETRATO ESTÁ EN ESTE COFRE</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Plata</td>
</tr>

<tr>
<td class="org-left">EL RETRATO NO ESTÁ AQUÍ</td>
</tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Plomo</td>
</tr>

<tr>
<td class="org-left">EL RETRATO NO ESTÁ EN EL COFRE DE ORO</td>
</tr>
</tbody>
</table>


<p>
Porcia explicó al pretendiente que de los tres enunciados, a lo sumo uno
era verdad. ¿Cuál cofre debe de elegir el pretendiente?
</p>
</blockquote>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b9ca4a;">let</span> <span style="color: #e7c547;">CP</span> = <span style="color: #b9ca4a;">new</span> <span style="color: #7aa6da;">CPManager</span>();
<span style="color: #b9ca4a;">let</span> <span style="color: #e7c547;">cofres</span> = Cofre.creaCofres(CP,[<span style="color: #70c0b1;">"Oro"</span>,<span style="color: #70c0b1;">"Plata"</span>,<span style="color: #70c0b1;">"Plomo"</span>]);
<span style="color: #b9ca4a;">let</span> [<span style="color: #e7c547;">cofreOro</span>,<span style="color: #e7c547;">cofrePlata</span>,<span style="color: #e7c547;">cofrePlomo</span>] = cofres;

cofreOro.inscripciones = [cofreOro.cofreLleno];
cofrePlata.inscripciones = [CP.Not(cofrePlata.cofreLleno)];
cofrePlomo.inscripciones = [CP.Not(cofreOro.cofreLleno)];

CP.SomeTrue(cofres.map(c=&gt;c.inscripciones[0]),0,1).
    rename( <span style="color: #70c0b1;">"Como mucho una inscripcion es cierta"</span>).
    asTrue();
</pre>
</div>
</problemaporciaysolucion>



<script src="./tabthis.js"></script>
<script>tabElements("problemaporciaysolucion")</script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Fecha: 2018-08-31</p>
<p class="author">Autor: Álvaro González Sotillo</p>
<p class="date">Created: 2018-08-17 vie 20:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
